In [69]:
! pip install   pandas

Requirement already satisfied: pandas in c:\users\vyasp\appdata\local\programs\python\python313\lib\site-packages (2.3.0)
Requirement already satisfied: numpy>=1.26.0 in c:\users\vyasp\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\vyasp\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\vyasp\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\vyasp\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\vyasp\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Used_Bikes.csv")

In [3]:
df.shape

(32648, 8)

In [4]:
df.columns

Index(['bike_name', 'price', 'city', 'kms_driven', 'owner', 'age', 'power',
       'brand'],
      dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32648 entries, 0 to 32647
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   32648 non-null  object
 1   price       32648 non-null  float64
 2   city        32648 non-null  object
 3   kms_driven  32648 non-null  float64
 4   owner       32648 non-null  object
 5   age         32648 non-null  float64
 6   power       32648 non-null  float64
 7   brand       32648 non-null  object
dtypes: float64(4), object(4)
memory usage: 2.0+ MB

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
dt= {'name':['a','b','c'],
    'marks':[1,2,3],
    'age':[1,2,3],
    }

In [8]:

df1 = pd.DataFrame(dt)
df1

  name  marks  age
0    a      1    1
1    b      2    2
2    c      3    3

In [9]:
import numpy as np
arr=np.arange(1,61).reshape(12,5)
arr

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25],
       [26, 27, 28, 29, 30],
       [31, 32, 33, 34, 35],
       [36, 37, 38, 39, 40],
       [41, 42, 43, 44, 45],
       [46, 47, 48, 49, 50],
       [51, 52, 53, 54, 55],
       [56, 57, 58, 59, 60]])

In [10]:
df2=pd.DataFrame(arr,columns=['a','b','c','d','e'])

In [11]:
df2

     a   b   c   d   e
0    1   2   3   4   5
1    6   7   8   9  10
2   11  12  13  14  15
3   16  17  18  19  20
4   21  22  23  24  25
5   26  27  28  29  30
6   31  32  33  34  35
7   36  37  38  39  40
8   41  42  43  44  45
9   46  47  48  49  50
10  51  52  53  54  55
11  56  57  58  59  60

In [12]:
df.head(10)

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
5,Yamaha FZs 150cc,53499.0,Delhi,25000.0,First Owner,6.0,150.0,Yamaha
6,Honda CB Hornet 160R ABS DLX,85000.0,Delhi,8200.0,First Owner,3.0,160.0,Honda
7,Hero Splendor Plus Self Alloy 100cc,45000.0,Delhi,12645.0,First Owner,3.0,100.0,Hero
8,Royal Enfield Thunderbird X 350cc,145000.0,Bangalore,9190.0,First Owner,3.0,350.0,Royal Enfield
9,Royal Enfield Classic Desert Storm 500cc,88000.0,Delhi,19000.0,Second Owner,7.0,500.0,Royal Enfield

In [13]:
df.tail()

,bike_name,price,city,kms_driven,owner,age,power,brand
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

In [14]:
df[['price','city']]

          price       city
0       35000.0  Ahmedabad
1      119900.0      Delhi
2      600000.0      Delhi
3       65000.0  Bangalore
4       80000.0  Bangalore
...         ...        ...
32643   39000.0      Delhi
32644   30000.0     Karnal
32645   60000.0      Delhi
32646   15600.0     Jaipur
32647   22000.0       Pune

[32648 rows x 2 columns]

In [15]:
df[0:3]

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph

#iloc and loc
ilkoc intger location
loc label location

In [16]:
df.iloc[0:3,0:3]

                            bike_name     price       city
0  TVS Star City Plus Dual Tone 110cc   35000.0  Ahmedabad
1         Royal Enfield Classic 350cc  119900.0      Delhi
2                Triumph Daytona 675R  600000.0      Delhi

In [17]:
df.loc[0:3, ['bike_name','price','age']]

                            bike_name     price  age
0  TVS Star City Plus Dual Tone 110cc   35000.0  3.0
1         Royal Enfield Classic 350cc  119900.0  4.0
2                Triumph Daytona 675R  600000.0  8.0
3                TVS Apache RTR 180cc   65000.0  4.0

In [18]:
df.max()
df['price'].max()

np.float64(1900000.0)

In [19]:
len(df['city'].unique())

443

In [20]:
df['city'].nunique()

443

In [21]:
df['city'].value_counts()

city
Delhi         7318
Bangalore     2723
Mumbai        2591
Hyderabad     2160
Pune          1724
              ...
Berhampore       1
Silvasa          1
Hospet           1
Palai            1
Sidhi            1
Name: count, Length: 443, dtype: int64

In [22]:
 delhi=df[df['city']=='Delhi']

In [23]:
df['owner'].value_counts()

owner
First Owner             29964
Second Owner             2564
Third Owner               108
Fourth Owner Or More       12
Name: count, dtype: int64

In [24]:

fourth_owner_delhi = df[
    (df['city'] == 'Delhi') & 
    (df['owner'] == 'Fourth Owner Or More')
]

print(fourth_owner_delhi)

                               bike_name    price   city  kms_driven  \
2999     Royal Enfield Thunderbird 350cc  95000.0  Delhi      9392.0
7038  Royal Enfield Bullet Electra 350cc  35000.0  Delhi     60000.0

                     owner   age  power          brand
2999  Fourth Owner Or More   6.0  350.0  Royal Enfield
7038  Fourth Owner Or More  18.0  350.0  Royal Enfield

In [25]:
delhi[(delhi['owner']=='Fourth Owner Or More')&(delhi['kms_driven']<=65000)]

,bike_name,price,city,kms_driven,owner,age,power,brand
2999,Royal Enfield Thunderbird 350cc,95000.0,Delhi,9392.0,Fourth Owner Or More,6.0,350.0,Royal Enfield
7038,Royal Enfield Bullet Electra 350cc,35000.0,Delhi,60000.0,Fourth Owner Or More,18.0,350.0,Royal Enfield

In [26]:
df[ (df['brand'] == 'TVS') & (df['age'] < 3.0 )&(df["price"]<50000)]

,bike_name,price,city,kms_driven,owner,age,power,brand
7055,TVS Sport 100cc,46000.0,Faridabad,6222.0,First Owner,2.0,100.0,TVS

In [27]:
df.duplicated().sum()

np.int64(25324)

In [28]:
df=df.drop_duplicates()
df
df.duplicated().sum()

np.int64(0)

In [29]:
df.isnull().sum()

bike_name     0
price         0
city          0
kms_driven    0
owner         0
age           0
power         0
brand         0
dtype: int64

In [30]:
print("hello world")

hello world